# <h1><center>Data Handling using Pandas II<center><h1>

In [1]:
# First we will make a dataFrame of marks of Students for multiple subjects

In [2]:
import pandas as pd

In [3]:
 marksUT= {'Name':['Raman','Raman','Raman','Zuhaire','Zuhaire','Zuhaire', 'Ashravy','Ashravy','Ashravy','Mishti','Mishti','Mishti'],
 'UT':[1,2,3,1,2,3,1,2,3,1,2,3],
 'Maths':[22,21,14,20,23,22,23,24,12,15,18,17],
 'Science':[21,20,19,17,15,18,19,22,25,22,21,18],
 'S.St':[18,17,15,22,21,19,20,24,19,25,25,20],
 'Hindi':[20,22,24,24,25,23,15,17,21,22,24,25],
 'Eng':[21,24,23,19,15,13,22,21,23,22,23,20]
 }

In [4]:
df=pd.DataFrame(marksUT)

In [5]:
print(df)

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

# <h2><center>Descriptive Statistics<center><h2>

# <h3><center>Maximum<center><h3>

In [6]:
df.max()

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St            25
Hindi           25
Eng             24
dtype: object

In [7]:
"""If we want to output maximum value for the columns
having only numeric values, then we can set the
parameter numeric_only=True in the max() method"""

'If we want to output maximum value for the columns\nhaving only numeric values, then we can set the\nparameter numeric_only=True in the max() method'

In [8]:
df.max(numeric_only=True)

UT          3
Maths      24
Science    25
S.St       25
Hindi      25
Eng        24
dtype: int64

In [9]:
dfUT2=df[df.UT==2]

In [10]:
dfUT2

       Name  UT  Maths  Science  S.St  Hindi  Eng
1     Raman   2     21       20    17     22   24
4   Zuhaire   2     23       15    21     25   15
7   Ashravy   2     24       22    24     17   21
10   Mishti   2     18       21    25     24   23

In [11]:
dfUT2.max(numeric_only=True)

UT          2
Maths      24
Science    22
S.St       25
Hindi      25
Eng        24
dtype: int64

In [12]:
# By default max() method will find the maximum of each column, to find
# the maximum value of each row, we have to use axis=1

In [13]:
df.max(numeric_only=True,axis=1)

0     22
1     24
2     24
3     24
4     25
5     23
6     23
7     24
8     25
9     25
10    25
11    25
dtype: int64

In [14]:
dfUT2.max(numeric_only=True,axis=1)

1     24
4     25
7     24
10    25
dtype: int64

# <h3><center>Minimum<center><h3>

In [15]:
df.min()

Name       Ashravy
UT               1
Maths           12
Science         15
S.St            15
Hindi           15
Eng             13
dtype: object

In [16]:
df.min(numeric_only=True)

UT          1
Maths      12
Science    15
S.St       15
Hindi      15
Eng        13
dtype: int64

In [17]:
dfMishti=df.loc[df.Name == 'Mishti']

In [18]:
dfMishti

      Name  UT  Maths  Science  S.St  Hindi  Eng
9   Mishti   1     15       22    25     22   22
10  Mishti   2     18       21    25     24   23
11  Mishti   3     17       18    20     25   20

In [19]:
dfMishti.min(numeric_only=True)

UT          1
Maths      15
Science    18
S.St       20
Hindi      22
Eng        20
dtype: int64

In [20]:
#Suppose we don't want to determine the minimum value of UT columns, then

In [21]:
dfMishti=df[["Maths","Science","S.St","Hindi","Eng"]]

In [22]:
dfMishti.min()

Maths      12
Science    15
S.St       15
Hindi      15
Eng        13
dtype: int64

# <h3><center>Sum<center><h3>

In [23]:
df.sum()

Name       RamanRamanRamanZuhaireZuhaireZuhaireAshravyAsh...
UT                                                        24
Maths                                                    231
Science                                                  237
S.St                                                     245
Hindi                                                    262
Eng                                                      246
dtype: object

In [24]:
df.sum(numeric_only=True)

UT          24
Maths      231
Science    237
S.St       245
Hindi      262
Eng        246
dtype: int64

In [25]:
df["Maths"].sum()

231

In [26]:
dfRaman=df[df.Name=="Raman"]

In [27]:
dfRaman.sum()

Name       RamanRamanRaman
UT                       6
Maths                   57
Science                 60
S.St                    50
Hindi                   66
Eng                     68
dtype: object

In [28]:
dfRaman[["Maths","Science","S.St","Hindi","Eng"]]

   Maths  Science  S.St  Hindi  Eng
0     22       21    18     20   21
1     21       20    17     22   24
2     14       19    15     24   23

In [29]:
dfRaman[["Maths","Science","S.St","Hindi","Eng"]].sum(axis=1)

0    102
1    104
2     95
dtype: int64

# <h3><center>Number of values<center><h3>

In [30]:
df.count()

Name       12
UT         12
Maths      12
Science    12
S.St       12
Hindi      12
Eng        12
dtype: int64

In [31]:
df.count(axis=1)

0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
dtype: int64

# <h3><center>Calculating mean<center><h3>

In [32]:
df.mean()

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_1000\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

UT          2.000000
Maths      19.250000
Science    19.750000
S.St       20.416667
Hindi      21.833333
Eng        20.500000
dtype: float64

In [33]:
df.mean(axis=1)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_1000\3676274908.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)

0     17.166667
1     17.666667
2     16.333333
3     17.166667
4     16.833333
5     16.333333
6     16.666667
7     18.333333
8     17.166667
9     17.833333
10    18.833333
11    17.166667
dtype: float64

In [34]:
dfZuhaire=df[df.Name=="Zuhaire"]

In [35]:
dfZuhaire

      Name  UT  Maths  Science  S.St  Hindi  Eng
3  Zuhaire   1     20       17    22     24   19
4  Zuhaire   2     23       15    21     25   15
5  Zuhaire   3     22       18    19     23   13

In [36]:
dfZuhaireMarks=dfZuhaire.loc[:,"Maths":"Eng"]

In [37]:
dfZuhaireMarks.mean()

Maths      21.666667
Science    16.666667
S.St       20.666667
Hindi      24.000000
Eng        15.666667
dtype: float64

In [38]:
dfZuhaireMarks.mean(axis=1)

3    20.4
4    19.8
5    19.0
dtype: float64

In [39]:
dfMaths=df[["Maths"]]

In [40]:
dfMaths

    Maths
0      22
1      21
2      14
3      20
4      23
5      22
6      23
7      24
8      12
9      15
10     18
11     17

In [41]:
dfMathsUT1=dfMaths[df.UT==1]

In [42]:
dfMathsUT1.median()

Maths    21.0
dtype: float64


# <h3><center>Calculating mode<center><h3>

In [43]:
df["Hindi"].mode()

0    24
Name: Hindi, dtype: int64


# <h3><center>Calculating mode<center><h3>

In [44]:
df.quantile(q=0.25) # The first quartile of each column

UT          1.00
Maths      16.50
Science    18.00
S.St       18.75
Hindi      20.75
Eng        19.75
Name: 0.25, dtype: float64

In [45]:
df.quantile(q=0.50)  # The second quartile of each column

UT          2.0
Maths      20.5
Science    19.5
S.St       20.0
Hindi      22.5
Eng        21.5
Name: 0.5, dtype: float64

In [46]:
df.quantile(q=0.75)  # The third quartile of each column

UT          3.00
Maths      22.25
Science    21.25
S.St       22.50
Hindi      24.00
Eng        23.00
Name: 0.75, dtype: float64

In [47]:
dfSubjects=df[["Maths","Science","S.St","Hindi","Eng"]]

In [48]:
dfSubjects.quantile([0.25,0.75])

      Maths  Science   S.St  Hindi    Eng
0.25  16.50    18.00  18.75  20.75  19.75
0.75  22.25    21.25  22.50  24.00  23.00

# <h3><center>Calculating Variance<center><h3>

In [49]:
df[["Maths","Science","S.St","Hindi","Eng"]].var()

Maths      15.840909
Science     7.113636
S.St        9.901515
Hindi       9.969697
Eng        11.363636
dtype: float64

In [50]:
df[["Maths","Science","S.St","Hindi","Eng"]].var(axis=1)

0      2.3
1      6.7
2     20.5
3      7.3
4     21.2
5     15.5
6      9.7
7      8.3
8     25.0
9     13.7
10     7.7
11     9.5
dtype: float64

# <h3><center>Standard deviation<center><h3>

In [51]:
df[["Maths","Science","S.St","Hindi","Eng"]].std()

Maths      3.980064
Science    2.667140
S.St       3.146667
Hindi      3.157483
Eng        3.370999
dtype: float64

In [52]:
df[["Maths","Science","S.St","Hindi","Eng"]].std(axis=1)

0     1.516575
1     2.588436
2     4.527693
3     2.701851
4     4.604346
5     3.937004
6     3.114482
7     2.880972
8     5.000000
9     3.701351
10    2.774887
11    3.082207
dtype: float64

# <h3><center>Data Aggregation<center><h3>

In [53]:
df.aggregate("max")

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St            25
Hindi           25
Eng             24
dtype: object

In [54]:
df.aggregate(["max","count"])

          Name  UT  Maths  Science  S.St  Hindi  Eng
max    Zuhaire   3     24       25    25     25   24
count       12  12     12       12    12     12   12

In [55]:
df.aggregate(["max","min"])

        Name  UT  Maths  Science  S.St  Hindi  Eng
max  Zuhaire   3     24       25    25     25   24
min  Ashravy   1     12       15    15     15   13

In [56]:
df["Maths"].aggregate(["min","max","count"])

min      12
max      24
count    12
Name: Maths, dtype: int64

In [60]:
dfUT2=df[df.UT==2]

In [62]:
dfUT2

       Name  UT  Maths  Science  S.St  Hindi  Eng
1     Raman   2     21       20    17     22   24
4   Zuhaire   2     23       15    21     25   15
7   Ashravy   2     24       22    24     17   21
10   Mishti   2     18       21    25     24   23

In [65]:
dfUT2.sort_values(by=["Science"],ascending=True)

       Name  UT  Maths  Science  S.St  Hindi  Eng
4   Zuhaire   2     23       15    21     25   15
1     Raman   2     21       20    17     22   24
10   Mishti   2     18       21    25     24   23
7   Ashravy   2     24       22    24     17   21

In [67]:
dfUT2.sort_values(by=["Science"],ascending=False)

       Name  UT  Maths  Science  S.St  Hindi  Eng
7   Ashravy   2     24       22    24     17   21
10   Mishti   2     18       21    25     24   23
1     Raman   2     21       20    17     22   24
4   Zuhaire   2     23       15    21     25   15

In [69]:
dfUT3=df[df.UT==3]

In [73]:
dfUT3.sort_values(by=["Eng"],ascending=True)

       Name  UT  Maths  Science  S.St  Hindi  Eng
5   Zuhaire   3     22       18    19     23   13
11   Mishti   3     17       18    20     25   20
2     Raman   3     14       19    15     24   23
8   Ashravy   3     12       25    19     21   23

In [75]:
dfUT3.sort_values(by=["Eng"],ascending=False)

       Name  UT  Maths  Science  S.St  Hindi  Eng
2     Raman   3     14       19    15     24   23
8   Ashravy   3     12       25    19     21   23
11   Mishti   3     17       18    20     25   20
5   Zuhaire   3     22       18    19     23   13

In [79]:
dfUT3.sort_values(by=["Science","Eng"],ascending=True)

       Name  UT  Maths  Science  S.St  Hindi  Eng
5   Zuhaire   3     22       18    19     23   13
11   Mishti   3     17       18    20     25   20
2     Raman   3     14       19    15     24   23
8   Ashravy   3     12       25    19     21   23

In [89]:
g1=df.groupby("Name")

In [103]:
g1.get_group("Raman")

    Name  UT  Maths  Science  S.St  Hindi  Eng
0  Raman   1     22       21    18     20   21
1  Raman   2     21       20    17     22   24
2  Raman   3     14       19    15     24   23

In [106]:
g1.size()

Name
Ashravy    3
Mishti     3
Raman      3
Zuhaire    3
dtype: int64

In [107]:
g2=df.groupby(["Name","UT"])

In [111]:
g2.groups

{('Ashravy', 1): [6], ('Ashravy', 2): [7], ('Ashravy', 3): [8], ('Mishti', 1): [9], ('Mishti', 2): [10], ('Mishti', 3): [11], ('Raman', 1): [0], ('Raman', 2): [1], ('Raman', 3): [2], ('Zuhaire', 1): [3], ('Zuhaire', 2): [4], ('Zuhaire', 3): [5]}

In [115]:
g2.get_group(('Ashravy', 3))

      Name  UT  Maths  Science  S.St  Hindi  Eng
8  Ashravy   3     12       25    19     21   23

In [117]:
g2.first()

            Maths  Science  S.St  Hindi  Eng
Name    UT
Ashravy 1      23       19    20     15   22
        2      24       22    24     17   21
        3      12       25    19     21   23
Mishti  1      15       22    25     22   22
        2      18       21    25     24   23
        3      17       18    20     25   20
Raman   1      22       21    18     20   21
        2      21       20    17     22   24
        3      14       19    15     24   23
Zuhaire 1      20       17    22     24   19
        2      23       15    21     25   15
        3      22       18    19     23   13

In [121]:
df.groupby(["UT"]).agg("mean")

    Maths  Science   S.St  Hindi    Eng
UT
1   20.00    19.75  21.25  20.25  21.00
2   21.50    19.50  21.75  22.00  20.75
3   16.25    20.00  18.25  23.25  19.75

In [123]:
g3=df.groupby(["UT"])

In [125]:
g3["Maths"].agg("mean")

UT
1    20.00
2    21.50
3    16.25
Name: Maths, dtype: float64

In [132]:
df.groupby("Name")["Maths"].agg(["mean","var","quantile","std"])

              mean        var  quantile       std
Name
Ashravy  19.666667  44.333333      23.0  6.658328
Mishti   16.666667   2.333333      17.0  1.527525
Raman    19.000000  19.000000      21.0  4.358899
Zuhaire  21.666667   2.333333      22.0  1.527525

In [135]:
df.groupby("UT")["Science"].agg(["mean"])

     mean
UT
1   19.75
2   19.50
3   20.00

In [169]:
dfUT1=df[df.UT==1]
print(dfUT1)

      Name  UT  Maths  Science  S.St  Hindi  Eng
0    Raman   1     22       21    18     20   21
3  Zuhaire   1     20       17    22     24   19
6  Ashravy   1     23       19    20     15   22
9   Mishti   1     15       22    25     22   22

In [170]:
dfUT1.reset_index(inplace=True)

In [171]:
dfUT1

   index     Name  UT  Maths  Science  S.St  Hindi  Eng
0      0    Raman   1     22       21    18     20   21
1      3  Zuhaire   1     20       17    22     24   19
2      6  Ashravy   1     23       19    20     15   22
3      9   Mishti   1     15       22    25     22   22

In [172]:
dfUT1.drop(columns=["index"],inplace=True)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_1000\522226873.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfUT1.drop(columns=["index"],inplace=True)

In [173]:
dfUT1

      Name  UT  Maths  Science  S.St  Hindi  Eng
0    Raman   1     22       21    18     20   21
1  Zuhaire   1     20       17    22     24   19
2  Ashravy   1     23       19    20     15   22
3   Mishti   1     15       22    25     22   22

In [174]:
dfUT1.set_index("Name",inplace=True)

In [175]:
dfUT1

         UT  Maths  Science  S.St  Hindi  Eng
Name
Raman     1     22       21    18     20   21
Zuhaire   1     20       17    22     24   19
Ashravy   1     23       19    20     15   22
Mishti    1     15       22    25     22   22

In [176]:
dfUT1.reset_index("Name", inplace=True)

In [179]:
dfUT1

      Name  UT  Maths  Science  S.St  Hindi  Eng
0    Raman   1     22       21    18     20   21
1  Zuhaire   1     20       17    22     24   19
2  Ashravy   1     23       19    20     15   22
3   Mishti   1     15       22    25     22   22